tea_tracker/app/controllers/home_controller.rb

  def dashboard
    @teas = current_user.teas
    @tea_type_counts = @teas.group(:category).count
    @average_tea_cost = @teas.average(:price).to_f
    @popular_ship_from = @teas.group(:ship_from).count.sort_by { |_location, count| -count }.first(5).to_h
    @top_entry = current_user.entries.order(rank: :desc).first
    @top_ranked_tea = @top_entry&.tea
    @total_teas = @teas.count
    @most_expensive_tea = @teas.order(price: :desc).first
    @least_popular_tea = @teas.order(:popularity).first
---
SELECT COUNT(*) AS "count_all", "teas"."category" AS "teas_category" FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63 GROUP BY "teas"."category"
SELECT "teas".* FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63 ORDER BY "teas"."price" DESC LIMIT 1
SELECT MIN("teas"."price") FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63
SELECT COUNT(*) AS "count_all", "teas"."ship_from" AS "teas_ship_from" FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63 GROUP BY "teas"."ship_from"
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 63 ORDER BY "entries"."rank" DESC LIMIT 1
SELECT "teas".* FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63 ORDER BY "teas"."popularity" ASC LIMIT 1

  def analytics
    @teas = current_user.teas
    @total_teas = @teas.count
    @tea_categories = @teas.pluck(:category).uniq
    @avg_rank = @teas.average(:rank).to_f
    @total_value = @teas.sum(:price)

    # Calculate average rank by category
    @category_avg_ranks = {}
    @tea_categories.each do |category|
      @category_avg_ranks[category] = @teas.where(category: category).average(:rank).to_f
    end

    # Get vendor statistics
    @vendors = @teas.pluck(:vendor).uniq
    @vendor_tea_counts = @teas.group(:vendor).count
    @vendor_avg_prices = {}
    @vendors.each do |vendor|
      @vendor_avg_prices[vendor] = @teas.where(vendor: vendor).average(:price).to_f
    end

    # Get origin statistics
    @origins = @teas.pluck(:ship_from).uniq
    @origin_tea_counts = @teas.group(:ship_from).count
---
SELECT "teas"."category" FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63
SELECT "teas"."price" FROM "teas"
SELECT AVG("teas"."price") FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63
SELECT COUNT(*) AS "count_all", "teas"."category" AS "teas_category" FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63 GROUP BY "teas"."category"
SELECT COUNT(*) FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63