tea_tracker/app/controllers/home_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 63 ORDER BY "entries"."rank" DESC LIMIT 1
---
  def dashboard
    @selected_category = params[:category]
    @teas = if @selected_category.present?
      Tea.joins(:entries).where(entries: { user_id: current_user.id }).where(category: @selected_category)
    else
      Tea.joins(:entries).where(entries: { user_id: current_user.id })
    end

    @user_teas = @teas.pluck(:name, :price, :grams, :category)
    @tea_categories = @teas.pluck(:category).uniq

    # Gauge metrics (avg $ and percentile vs all teas)
    user_prices   = @teas.map(&:price)
    all_prices    = Tea.pluck(:price).compact.sort
    @user_avg     = user_prices.sum.to_f / [user_prices.size,1].max
    @global_qtiles = all_prices.each_slice((all_prices.size/4.0).ceil).map(&:last)
    @percentile   = (all_prices.count { |p| p < @user_avg } * 100.0 / all_prices.size)

    @tea_type_counts   = @teas.group(:category).count
    @average_tea_cost  = @teas.average(:price).to_f
    @popular_ship_from = @teas.group(:ship_from).count.sort_by { |_loc,c| -c }.first(5).to_h
    @top_entry         = current_user.entries.order(rank: :desc).first

SELECT "teas".* FROM "teas" INNER JOIN "entries" ON "entries"."tea_id" = "teas"."id" WHERE "entries"."user_id" = 63 ORDER BY "teas"."price" DESC LIMIT 1
---
  def analytics
    @teas = Tea.joins(:entries).where(entries: { user_id: current_user.id })
    @total_teas = @teas.count
    @tea_categories = @teas.pluck(:category).uniq
    @avg_rank = @teas.average(:rank).to_f
    @total_value = @teas.sum(:price)